leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC2_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061218u)

/** \brief  1A, Error Tracking Register */
#define MC2_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006121Au)

/** \brief  4, MBIST Control Register */
#define MC2_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061204u)

/** \brief  6, Status Register */
#define MC2_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061206u)

/** \brief  8, Range Register, single address mode */
#define MC2_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061208u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC2_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC2_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC2_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC2_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC2_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC2_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC2_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC2_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC2_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC2_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC2_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC2_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC2_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC2_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC2_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC2_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC2_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC2_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC2_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC2_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC2_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC2_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC2_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC2_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC2_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC2_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC2_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC2_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC2_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC2_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC2_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC2_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC2_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC2_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC2_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC2_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC2_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC2_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC2_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC2_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B2u)

/** \brief  C, Revision ID Register */
#define MC2_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006120Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc3
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC3_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061300u)

/** \brief  2, Configuration Register 1 */
#define MC3_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061302u)

/** \brief  10, Memory ECC Detection Register */
#define MC3_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061310u)

/** \brief  E, ECC Safety Register */
#define MC3_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006130Eu)

/** \brief  12, Error Tracking Register */
#define MC3_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061312u)

/** \brief  14, Error Tracking Register */
#define MC3_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061314u)

/** \brief  16, Error Tracking Register */
#define MC3_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061316u)

