leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC5_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061518u)

/** \brief  1A, Error Tracking Register */
#define MC5_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006151Au)

/** \brief  4, MBIST Control Register */
#define MC5_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061504u)

/** \brief  6, Status Register */
#define MC5_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061506u)

/** \brief  8, Range Register, single address mode */
#define MC5_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061508u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC5_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC5_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC5_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC5_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC5_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC5_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC5_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC5_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC5_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC5_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC5_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC5_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC5_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC5_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC5_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC5_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC5_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC5_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC5_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC5_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC5_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC5_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC5_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC5_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC5_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC5_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC5_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC5_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC5_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC5_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC5_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC5_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC5_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC5_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC5_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC5_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC5_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC5_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC5_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC5_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B2u)

/** \brief  C, Revision ID Register */
#define MC5_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006150Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc6
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC6_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061600u)

/** \brief  2, Configuration Register 1 */
#define MC6_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061602u)

/** \brief  10, Memory ECC Detection Register */
#define MC6_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061610u)

/** \brief  E, ECC Safety Register */
#define MC6_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006160Eu)

/** \brief  12, Error Tracking Register */
#define MC6_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061612u)

/** \brief  14, Error Tracking Register */
#define MC6_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061614u)

/** \brief  16, Error Tracking Register */
#define MC6_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061616u)

