leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC7_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061718u)

/** \brief  1A, Error Tracking Register */
#define MC7_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006171Au)

/** \brief  4, MBIST Control Register */
#define MC7_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061704u)

/** \brief  6, Status Register */
#define MC7_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061706u)

/** \brief  8, Range Register, single address mode */
#define MC7_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061708u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC7_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC7_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC7_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC7_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC7_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC7_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC7_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC7_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC7_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC7_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC7_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC7_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC7_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC7_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC7_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC7_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC7_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC7_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC7_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC7_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC7_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC7_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC7_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC7_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC7_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC7_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC7_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC7_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC7_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC7_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC7_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC7_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC7_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC7_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC7_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC7_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC7_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC7_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC7_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC7_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00617B2u)

/** \brief  C, Revision ID Register */
#define MC7_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006170Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc8
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC8_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061800u)

/** \brief  2, Configuration Register 1 */
#define MC8_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061802u)

/** \brief  10, Memory ECC Detection Register */
#define MC8_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061810u)

/** \brief  E, ECC Safety Register */
#define MC8_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006180Eu)

/** \brief  12, Error Tracking Register */
#define MC8_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061812u)

/** \brief  14, Error Tracking Register */
#define MC8_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061814u)

/** \brief  16, Error Tracking Register */
#define MC8_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061816u)

