leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC11_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061B18u)

/** \brief  1A, Error Tracking Register */
#define MC11_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061B1Au)

/** \brief  4, MBIST Control Register */
#define MC11_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061B04u)

/** \brief  6, Status Register */
#define MC11_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061B06u)

/** \brief  8, Range Register, single address mode */
#define MC11_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061B08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC11_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC11_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC11_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC11_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC11_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC11_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC11_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC11_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC11_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC11_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC11_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC11_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC11_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC11_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC11_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC11_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC11_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC11_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC11_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC11_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC11_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC11_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC11_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC11_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC11_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC11_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC11_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC11_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC11_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC11_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC11_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC11_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC11_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC11_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC11_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC11_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC11_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC11_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC11_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC11_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061BB2u)

/** \brief  C, Revision ID Register */
#define MC11_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc12
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC12_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061C00u)

/** \brief  2, Configuration Register 1 */
#define MC12_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061C02u)

/** \brief  10, Memory ECC Detection Register */
#define MC12_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061C10u)

/** \brief  E, ECC Safety Register */
#define MC12_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061C0Eu)

/** \brief  12, Error Tracking Register */
#define MC12_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C12u)

/** \brief  14, Error Tracking Register */
#define MC12_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C14u)

/** \brief  16, Error Tracking Register */
#define MC12_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061C16u)

