leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC20_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062418u)

/** \brief  1A, Error Tracking Register */
#define MC20_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006241Au)

/** \brief  4, MBIST Control Register */
#define MC20_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062404u)

/** \brief  6, Status Register */
#define MC20_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062406u)

/** \brief  8, Range Register, single address mode */
#define MC20_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062408u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC20_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC20_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC20_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC20_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC20_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC20_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC20_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC20_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC20_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC20_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC20_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC20_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC20_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC20_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC20_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC20_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC20_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC20_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC20_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC20_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC20_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC20_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC20_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC20_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC20_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC20_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC20_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC20_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC20_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC20_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC20_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC20_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC20_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC20_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC20_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC20_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC20_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC20_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC20_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC20_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00624B2u)

/** \brief  C, Revision ID Register */
#define MC20_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006240Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc21
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC21_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062500u)

/** \brief  2, Configuration Register 1 */
#define MC21_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062502u)

/** \brief  10, Memory ECC Detection Register */
#define MC21_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062510u)

/** \brief  E, ECC Safety Register */
#define MC21_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006250Eu)

/** \brief  12, Error Tracking Register */
#define MC21_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062512u)

/** \brief  14, Error Tracking Register */
#define MC21_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062514u)

/** \brief  16, Error Tracking Register */
#define MC21_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062516u)

