leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC22_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062618u)

/** \brief  1A, Error Tracking Register */
#define MC22_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006261Au)

/** \brief  4, MBIST Control Register */
#define MC22_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062604u)

/** \brief  6, Status Register */
#define MC22_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062606u)

/** \brief  8, Range Register, single address mode */
#define MC22_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062608u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC22_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC22_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC22_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC22_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC22_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC22_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC22_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC22_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC22_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC22_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC22_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC22_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC22_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC22_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC22_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC22_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC22_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC22_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC22_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC22_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC22_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC22_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC22_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC22_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC22_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC22_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC22_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC22_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC22_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC22_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC22_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC22_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC22_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC22_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC22_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC22_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC22_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC22_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC22_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC22_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B2u)

/** \brief  C, Revision ID Register */
#define MC22_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006260Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc23
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC23_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062700u)

/** \brief  2, Configuration Register 1 */
#define MC23_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062702u)

/** \brief  10, Memory ECC Detection Register */
#define MC23_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062710u)

/** \brief  E, ECC Safety Register */
#define MC23_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006270Eu)

/** \brief  12, Error Tracking Register */
#define MC23_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062712u)

/** \brief  14, Error Tracking Register */
#define MC23_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062714u)

/** \brief  16, Error Tracking Register */
#define MC23_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062716u)

