leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC31_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062F18u)

/** \brief  1A, Error Tracking Register */
#define MC31_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062F1Au)

/** \brief  4, MBIST Control Register */
#define MC31_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062F04u)

/** \brief  6, Status Register */
#define MC31_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062F06u)

/** \brief  8, Range Register, single address mode */
#define MC31_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062F08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC31_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC31_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC31_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC31_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC31_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC31_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC31_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC31_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC31_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC31_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC31_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC31_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC31_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC31_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC31_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC31_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC31_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC31_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC31_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC31_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC31_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC31_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC31_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC31_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC31_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC31_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC31_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC31_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC31_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC31_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC31_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC31_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC31_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC31_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC31_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC31_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC31_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC31_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC31_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC31_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB2u)

/** \brief  C, Revision ID Register */
#define MC31_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc32
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC32_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063000u)

/** \brief  2, Configuration Register 1 */
#define MC32_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063002u)

/** \brief  10, Memory ECC Detection Register */
#define MC32_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063010u)

/** \brief  E, ECC Safety Register */
#define MC32_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006300Eu)

/** \brief  12, Error Tracking Register */
#define MC32_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063012u)

/** \brief  14, Error Tracking Register */
#define MC32_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063014u)

/** \brief  16, Error Tracking Register */
#define MC32_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063016u)

