leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC36_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063418u)

/** \brief  1A, Error Tracking Register */
#define MC36_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006341Au)

/** \brief  4, MBIST Control Register */
#define MC36_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063404u)

/** \brief  6, Status Register */
#define MC36_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063406u)

/** \brief  8, Range Register, single address mode */
#define MC36_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063408u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC36_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC36_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC36_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC36_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC36_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC36_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC36_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC36_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC36_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC36_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC36_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC36_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC36_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC36_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC36_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC36_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC36_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC36_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC36_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC36_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC36_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC36_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC36_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC36_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC36_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC36_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC36_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC36_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC36_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC36_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC36_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC36_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC36_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC36_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC36_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC36_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC36_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC36_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC36_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC36_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B2u)

/** \brief  C, Revision ID Register */
#define MC36_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006340Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc37
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC37_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063500u)

/** \brief  2, Configuration Register 1 */
#define MC37_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063502u)

/** \brief  10, Memory ECC Detection Register */
#define MC37_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063510u)

/** \brief  E, ECC Safety Register */
#define MC37_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006350Eu)

/** \brief  12, Error Tracking Register */
#define MC37_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063512u)

/** \brief  14, Error Tracking Register */
#define MC37_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063514u)

/** \brief  16, Error Tracking Register */
#define MC37_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063516u)

