leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC38_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063618u)

/** \brief  1A, Error Tracking Register */
#define MC38_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006361Au)

/** \brief  4, MBIST Control Register */
#define MC38_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063604u)

/** \brief  6, Status Register */
#define MC38_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063606u)

/** \brief  8, Range Register, single address mode */
#define MC38_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063608u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC38_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC38_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC38_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC38_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC38_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC38_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC38_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC38_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC38_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC38_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC38_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC38_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC38_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC38_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC38_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC38_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC38_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC38_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC38_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC38_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC38_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC38_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC38_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC38_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC38_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC38_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC38_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC38_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC38_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC38_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC38_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC38_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC38_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC38_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC38_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC38_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC38_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC38_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC38_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC38_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00636B2u)

/** \brief  C, Revision ID Register */
#define MC38_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006360Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc39
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC39_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063700u)

/** \brief  2, Configuration Register 1 */
#define MC39_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063702u)

/** \brief  10, Memory ECC Detection Register */
#define MC39_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063710u)

/** \brief  E, ECC Safety Register */
#define MC39_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006370Eu)

/** \brief  12, Error Tracking Register */
#define MC39_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063712u)

/** \brief  14, Error Tracking Register */
#define MC39_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063714u)

/** \brief  16, Error Tracking Register */
#define MC39_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063716u)

