leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC39_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063718u)

/** \brief  1A, Error Tracking Register */
#define MC39_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006371Au)

/** \brief  4, MBIST Control Register */
#define MC39_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063704u)

/** \brief  6, Status Register */
#define MC39_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063706u)

/** \brief  8, Range Register, single address mode */
#define MC39_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063708u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC39_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC39_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC39_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC39_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC39_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC39_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC39_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC39_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC39_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC39_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC39_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC39_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC39_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC39_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC39_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC39_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC39_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC39_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC39_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC39_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC39_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC39_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC39_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC39_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC39_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC39_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC39_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC39_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC39_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC39_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC39_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC39_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC39_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC39_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC39_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC39_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC39_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC39_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC39_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC39_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00637B2u)

/** \brief  C, Revision ID Register */
#define MC39_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006370Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc40
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC40_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063800u)

/** \brief  2, Configuration Register 1 */
#define MC40_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063802u)

/** \brief  10, Memory ECC Detection Register */
#define MC40_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063810u)

/** \brief  E, ECC Safety Register */
#define MC40_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006380Eu)

/** \brief  12, Error Tracking Register */
#define MC40_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063812u)

/** \brief  14, Error Tracking Register */
#define MC40_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063814u)

/** \brief  16, Error Tracking Register */
#define MC40_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063816u)

