leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC40_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063818u)

/** \brief  1A, Error Tracking Register */
#define MC40_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006381Au)

/** \brief  4, MBIST Control Register */
#define MC40_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063804u)

/** \brief  6, Status Register */
#define MC40_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063806u)

/** \brief  8, Range Register, single address mode */
#define MC40_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063808u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC40_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC40_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC40_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC40_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC40_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC40_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC40_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC40_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC40_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC40_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC40_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC40_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC40_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC40_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC40_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC40_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC40_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC40_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC40_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC40_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC40_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC40_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC40_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC40_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC40_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC40_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC40_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC40_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC40_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC40_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC40_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC40_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC40_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC40_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC40_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC40_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC40_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC40_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC40_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC40_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00638B2u)

/** \brief  C, Revision ID Register */
#define MC40_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006380Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc41
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC41_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063900u)

/** \brief  2, Configuration Register 1 */
#define MC41_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063902u)

/** \brief  10, Memory ECC Detection Register */
#define MC41_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063910u)

/** \brief  E, ECC Safety Register */
#define MC41_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006390Eu)

/** \brief  12, Error Tracking Register */
#define MC41_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063912u)

/** \brief  14, Error Tracking Register */
#define MC41_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063914u)

/** \brief  16, Error Tracking Register */
#define MC41_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063916u)

