leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC49_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064118u)

/** \brief  1A, Error Tracking Register */
#define MC49_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006411Au)

/** \brief  4, MBIST Control Register */
#define MC49_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064104u)

/** \brief  6, Status Register */
#define MC49_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064106u)

/** \brief  8, Range Register, single address mode */
#define MC49_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064108u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC49_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC49_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC49_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC49_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC49_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC49_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC49_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC49_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC49_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC49_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC49_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC49_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC49_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC49_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC49_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC49_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC49_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC49_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC49_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC49_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC49_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC49_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC49_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC49_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC49_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC49_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC49_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC49_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC49_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC49_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC49_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC49_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC49_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC49_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC49_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC49_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC49_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC49_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC49_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC49_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00641B2u)

/** \brief  C, Revision ID Register */
#define MC49_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006410Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc50
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC50_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064200u)

/** \brief  2, Configuration Register 1 */
#define MC50_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064202u)

/** \brief  10, Memory ECC Detection Register */
#define MC50_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064210u)

/** \brief  E, ECC Safety Register */
#define MC50_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006420Eu)

/** \brief  12, Error Tracking Register */
#define MC50_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064212u)

/** \brief  14, Error Tracking Register */
#define MC50_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064214u)

/** \brief  16, Error Tracking Register */
#define MC50_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064216u)

