leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC59_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064B18u)

/** \brief  1A, Error Tracking Register */
#define MC59_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064B1Au)

/** \brief  4, MBIST Control Register */
#define MC59_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064B04u)

/** \brief  6, Status Register */
#define MC59_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064B06u)

/** \brief  8, Range Register, single address mode */
#define MC59_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064B08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC59_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC59_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC59_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC59_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC59_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC59_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC59_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC59_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC59_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC59_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC59_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC59_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC59_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC59_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC59_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC59_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC59_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC59_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC59_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC59_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC59_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC59_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC59_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC59_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC59_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC59_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC59_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC59_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC59_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC59_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC59_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC59_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC59_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC59_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC59_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC59_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC59_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC59_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC59_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC59_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB2u)

/** \brief  C, Revision ID Register */
#define MC59_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc60
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC60_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064C00u)

/** \brief  2, Configuration Register 1 */
#define MC60_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064C02u)

/** \brief  10, Memory ECC Detection Register */
#define MC60_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064C10u)

/** \brief  E, ECC Safety Register */
#define MC60_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064C0Eu)

/** \brief  12, Error Tracking Register */
#define MC60_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C12u)

/** \brief  14, Error Tracking Register */
#define MC60_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C14u)

/** \brief  16, Error Tracking Register */
#define MC60_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C16u)

