leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC60_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C18u)

/** \brief  1A, Error Tracking Register */
#define MC60_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C1Au)

/** \brief  4, MBIST Control Register */
#define MC60_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064C04u)

/** \brief  6, Status Register */
#define MC60_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064C06u)

/** \brief  8, Range Register, single address mode */
#define MC60_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064C08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC60_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC60_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC60_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC60_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC60_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC60_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC60_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC60_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC60_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC60_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC60_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC60_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC60_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC60_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC60_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC60_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC60_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC60_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC60_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC60_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC60_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC60_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC60_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC60_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC60_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC60_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC60_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC60_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC60_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC60_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC60_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC60_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC60_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC60_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC60_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC60_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC60_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC60_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC60_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC60_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB2u)

/** \brief  C, Revision ID Register */
#define MC60_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064C0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc61
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC61_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064D00u)

/** \brief  2, Configuration Register 1 */
#define MC61_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064D02u)

/** \brief  10, Memory ECC Detection Register */
#define MC61_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064D10u)

/** \brief  E, ECC Safety Register */
#define MC61_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064D0Eu)

/** \brief  12, Error Tracking Register */
#define MC61_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064D12u)

/** \brief  14, Error Tracking Register */
#define MC61_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064D14u)

/** \brief  16, Error Tracking Register */
#define MC61_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064D16u)

