leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC61_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064D18u)

/** \brief  1A, Error Tracking Register */
#define MC61_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064D1Au)

/** \brief  4, MBIST Control Register */
#define MC61_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064D04u)

/** \brief  6, Status Register */
#define MC61_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064D06u)

/** \brief  8, Range Register, single address mode */
#define MC61_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064D08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC61_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC61_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC61_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC61_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC61_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC61_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC61_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC61_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC61_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC61_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC61_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC61_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC61_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC61_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC61_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC61_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC61_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC61_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC61_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC61_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC61_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC61_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC61_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC61_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC61_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC61_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC61_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC61_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC61_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC61_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC61_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC61_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC61_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC61_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC61_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC61_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC61_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC61_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC61_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC61_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB2u)

/** \brief  C, Revision ID Register */
#define MC61_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc62
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC62_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064E00u)

/** \brief  2, Configuration Register 1 */
#define MC62_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064E02u)

/** \brief  10, Memory ECC Detection Register */
#define MC62_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064E10u)

/** \brief  E, ECC Safety Register */
#define MC62_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064E0Eu)

/** \brief  12, Error Tracking Register */
#define MC62_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E12u)

/** \brief  14, Error Tracking Register */
#define MC62_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E14u)

/** \brief  16, Error Tracking Register */
#define MC62_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E16u)

