leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC69_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065518u)

/** \brief  1A, Error Tracking Register */
#define MC69_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006551Au)

/** \brief  4, MBIST Control Register */
#define MC69_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065504u)

/** \brief  6, Status Register */
#define MC69_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065506u)

/** \brief  8, Range Register, single address mode */
#define MC69_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065508u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC69_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC69_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC69_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC69_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC69_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC69_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC69_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC69_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC69_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC69_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC69_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC69_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC69_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC69_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC69_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC69_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC69_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC69_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC69_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC69_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC69_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC69_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC69_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC69_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC69_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC69_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC69_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC69_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC69_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC69_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC69_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC69_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC69_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC69_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC69_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC69_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC69_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC69_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC69_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC69_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00655B2u)

/** \brief  C, Revision ID Register */
#define MC69_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006550Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc70
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC70_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065600u)

/** \brief  2, Configuration Register 1 */
#define MC70_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065602u)

/** \brief  10, Memory ECC Detection Register */
#define MC70_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065610u)

/** \brief  E, ECC Safety Register */
#define MC70_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006560Eu)

/** \brief  12, Error Tracking Register */
#define MC70_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065612u)

/** \brief  14, Error Tracking Register */
#define MC70_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065614u)

/** \brief  16, Error Tracking Register */
#define MC70_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065616u)

