leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC70_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065618u)

/** \brief  1A, Error Tracking Register */
#define MC70_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006561Au)

/** \brief  4, MBIST Control Register */
#define MC70_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065604u)

/** \brief  6, Status Register */
#define MC70_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065606u)

/** \brief  8, Range Register, single address mode */
#define MC70_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065608u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC70_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC70_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC70_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC70_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC70_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC70_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC70_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC70_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC70_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC70_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC70_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC70_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC70_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC70_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC70_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC70_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC70_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC70_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC70_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC70_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC70_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC70_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC70_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC70_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC70_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC70_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC70_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC70_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC70_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC70_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC70_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC70_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC70_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC70_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC70_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC70_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC70_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC70_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC70_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC70_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00656B2u)

/** \brief  C, Revision ID Register */
#define MC70_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006560Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc71
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC71_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065700u)

/** \brief  2, Configuration Register 1 */
#define MC71_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065702u)

/** \brief  10, Memory ECC Detection Register */
#define MC71_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065710u)

/** \brief  E, ECC Safety Register */
#define MC71_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006570Eu)

/** \brief  12, Error Tracking Register */
#define MC71_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065712u)

/** \brief  14, Error Tracking Register */
#define MC71_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065714u)

/** \brief  16, Error Tracking Register */
#define MC71_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065716u)

