leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC73_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065918u)

/** \brief  1A, Error Tracking Register */
#define MC73_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006591Au)

/** \brief  4, MBIST Control Register */
#define MC73_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065904u)

/** \brief  6, Status Register */
#define MC73_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065906u)

/** \brief  8, Range Register, single address mode */
#define MC73_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065908u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC73_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC73_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC73_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC73_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC73_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC73_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC73_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC73_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC73_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC73_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC73_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC73_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC73_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC73_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC73_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC73_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC73_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC73_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC73_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC73_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC73_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC73_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC73_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC73_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC73_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC73_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC73_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC73_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC73_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC73_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC73_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC73_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC73_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC73_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC73_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC73_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC73_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC73_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC73_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC73_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00659B2u)

/** \brief  C, Revision ID Register */
#define MC73_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006590Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc74
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC74_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065A00u)

/** \brief  2, Configuration Register 1 */
#define MC74_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065A02u)

/** \brief  10, Memory ECC Detection Register */
#define MC74_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065A10u)

/** \brief  E, ECC Safety Register */
#define MC74_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065A0Eu)

/** \brief  12, Error Tracking Register */
#define MC74_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065A12u)

/** \brief  14, Error Tracking Register */
#define MC74_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065A14u)

/** \brief  16, Error Tracking Register */
#define MC74_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065A16u)

