leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC74_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065A18u)

/** \brief  1A, Error Tracking Register */
#define MC74_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065A1Au)

/** \brief  4, MBIST Control Register */
#define MC74_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065A04u)

/** \brief  6, Status Register */
#define MC74_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065A06u)

/** \brief  8, Range Register, single address mode */
#define MC74_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065A08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC74_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC74_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC74_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC74_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC74_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC74_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ABAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC74_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ABCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC74_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ABEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC74_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC74_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC74_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC74_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC74_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC74_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC74_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ACAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC74_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ACCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC74_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ACEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC74_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC74_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC74_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC74_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC74_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC74_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ADAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC74_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC74_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ADCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC74_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ADEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC74_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC74_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC74_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC74_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC74_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC74_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC74_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC74_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC74_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC74_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC74_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC74_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC74_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC74_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065AB2u)

/** \brief  C, Revision ID Register */
#define MC74_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065A0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc75
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC75_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065B00u)

/** \brief  2, Configuration Register 1 */
#define MC75_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065B02u)

/** \brief  10, Memory ECC Detection Register */
#define MC75_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065B10u)

/** \brief  E, ECC Safety Register */
#define MC75_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065B0Eu)

/** \brief  12, Error Tracking Register */
#define MC75_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065B12u)

/** \brief  14, Error Tracking Register */
#define MC75_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065B14u)

/** \brief  16, Error Tracking Register */
#define MC75_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065B16u)

