leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC75_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065B18u)

/** \brief  1A, Error Tracking Register */
#define MC75_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065B1Au)

/** \brief  4, MBIST Control Register */
#define MC75_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065B04u)

/** \brief  6, Status Register */
#define MC75_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065B06u)

/** \brief  8, Range Register, single address mode */
#define MC75_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065B08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC75_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC75_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC75_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC75_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC75_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC75_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC75_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC75_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC75_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC75_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC75_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC75_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC75_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC75_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC75_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC75_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC75_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC75_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC75_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC75_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC75_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC75_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC75_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC75_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC75_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC75_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC75_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC75_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC75_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC75_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC75_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC75_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC75_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC75_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC75_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC75_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC75_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC75_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC75_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC75_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB2u)

/** \brief  C, Revision ID Register */
#define MC75_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc76
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC76_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065C00u)

/** \brief  2, Configuration Register 1 */
#define MC76_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065C02u)

/** \brief  10, Memory ECC Detection Register */
#define MC76_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065C10u)

/** \brief  E, ECC Safety Register */
#define MC76_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065C0Eu)

/** \brief  12, Error Tracking Register */
#define MC76_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C12u)

/** \brief  14, Error Tracking Register */
#define MC76_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C14u)

/** \brief  16, Error Tracking Register */
#define MC76_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C16u)

