leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC80_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066018u)

/** \brief  1A, Error Tracking Register */
#define MC80_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006601Au)

/** \brief  4, MBIST Control Register */
#define MC80_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066004u)

/** \brief  6, Status Register */
#define MC80_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066006u)

/** \brief  8, Range Register, single address mode */
#define MC80_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066008u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC80_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC80_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC80_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC80_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC80_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC80_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC80_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC80_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC80_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC80_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC80_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC80_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC80_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC80_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC80_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC80_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC80_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC80_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC80_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC80_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC80_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC80_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC80_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC80_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC80_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC80_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC80_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC80_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC80_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC80_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC80_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC80_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC80_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC80_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC80_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC80_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC80_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC80_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC80_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC80_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00660B2u)

/** \brief  C, Revision ID Register */
#define MC80_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006600Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc81
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC81_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066100u)

/** \brief  2, Configuration Register 1 */
#define MC81_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066102u)

/** \brief  10, Memory ECC Detection Register */
#define MC81_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066110u)

/** \brief  E, ECC Safety Register */
#define MC81_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006610Eu)

/** \brief  12, Error Tracking Register */
#define MC81_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066112u)

/** \brief  14, Error Tracking Register */
#define MC81_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066114u)

/** \brief  16, Error Tracking Register */
#define MC81_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066116u)

