leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC83_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066318u)

/** \brief  1A, Error Tracking Register */
#define MC83_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006631Au)

/** \brief  4, MBIST Control Register */
#define MC83_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066304u)

/** \brief  6, Status Register */
#define MC83_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066306u)

/** \brief  8, Range Register, single address mode */
#define MC83_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066308u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC83_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC83_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC83_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC83_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC83_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC83_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC83_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC83_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC83_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC83_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC83_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC83_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC83_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC83_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC83_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC83_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC83_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC83_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC83_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC83_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC83_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC83_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC83_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC83_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC83_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC83_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC83_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC83_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC83_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC83_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC83_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC83_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC83_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC83_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC83_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC83_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC83_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC83_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC83_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC83_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B2u)

/** \brief  C, Revision ID Register */
#define MC83_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006630Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc84
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC84_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066400u)

/** \brief  2, Configuration Register 1 */
#define MC84_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066402u)

/** \brief  10, Memory ECC Detection Register */
#define MC84_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066410u)

/** \brief  E, ECC Safety Register */
#define MC84_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006640Eu)

/** \brief  12, Error Tracking Register */
#define MC84_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066412u)

/** \brief  14, Error Tracking Register */
#define MC84_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066414u)

/** \brief  16, Error Tracking Register */
#define MC84_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066416u)

